//Лабораторная работа №2.
//Вариант №5.
//1) Программу, разработанную в лабораторной работе № 1, модифицировать таким образом,
//чтобы появилась возможность применять к объектам класса следующие операторы:
//•	Инкремент, декремент(можно только одну из префиксной и постфиксной форм).
//•	Сложение объектов класса.
//•	Операторы сравнения.
//•	Оператор присваивания.
//•	Оператор приведения к типу int(или другому численному).
//•	Операторы ввода и вывода в поток.
//ПРИМЕЧАНИЕ: логика использования оператора выбирается самостоятельно.
//Неуместные для данного класса операторы можно не реализовывать, заменив их какими - то другими.
//Общее количество перегруженных в классе операторов – около 8 - 10.
//2) Интерфейс пользователя должен обеспечивать :
//•	В начале работы программы создавать константный эталонный объект,
//и предоставлять пользователю возможность выбора операции сравнения.
//Эта операция применяется к эталонному объекту и всем остальным.Результаты выводить в виде таблицы.
//Таблица может выглядеть так(для класса время) :
//[1] 00 : 00 : 00  >   12:00 : 00    false
//[2] 17 : 10 : 00  >   12:00 : 00    true
//[3] 11 : 11 : 00  >   12:00 : 00    false		…..
//Но предпочтительней предусмотреть в этом цикле применение нескольких операторов сравнения
//с целью вывода корректного результата :
//[1] 00 : 00 : 00  <   12 : 00 : 00
//[2] 17 : 10 : 00  >   12 : 00 : 00
//[3] 12 : 00 : 00 = 12 : 00 : 00
//•	Предусмотреть возможность создания нового объекта,
//как результата выполнения  математической операции над одним из имеющихся.
//Операндами являются уже существующие в массиве объекты,
//либо с фиксированными номерами(0 - й для унарных операторов, 0 - й и 1 - й для бинарных),
//либо номера могут запрашиваться с клавиатуры.
#include "Fraction.h"
void main()
{
	Fraction **PFraction=new Fraction *[FractionDimSize];//массив указателей из FractionDimSize элементов
	SetConsoleCP(1251);//Ввод русских букв
	SetConsoleOutputCP(1251);//Вывод русских букв
	Menu(PFraction);
	delete[] PFraction;//освобождение памяти из под массива указателей
}